app/Helpers/log_helper.php

INSERT INTO `log_aktivitas` (`user`, `aktivitas`, `created_at`) VALUES ('hendrikomalang@gmail.com', 'Menambahkan penyewaan baru - ID: #1 - Penyewa: test5 - Total: Rp 1.290.000', '2026-04-17 18:38:25')
---
    function log_activity($aktivitas)
    {
        $db = Database::connect();

        $user = session()->get('email') ?? 'Guest';

        $db->table('log_aktivitas')->insert([
            'user'       => $user,
            'aktivitas'  => $aktivitas,
            'created_at' => date('Y-m-d H:i:s')
        ]);