app/Controllers/AdminDashboard.php

            ['nama' => 'Operator', 'total' => 3],
        ];

        $data = [
            'totalBarang'      => $jumlahBarang,
            'stokTotal'        => $totalStok,
            'totalUser'        => $userModel->countAll(),
            'todayMasuk'       => $todayMasuk,
            'todayKeluar'      => $todayKeluar,
            'totalStok'        => $totalStok,
            'jumlahBarang'     => $jumlahBarang,
            'totalTransaksi'   => $totalTransaksi,
            'transaksiHariIni' => $transaksiHariIni,
            'stokRendah'       => $stokRendah,
            'topOperator'      => $topOperator,
        ];
---
SELECT SUM(`stok`) AS `stok`
FROM `barang`
 LIMIT 1