app/Controllers/AdminDashboard.php

SELECT SUM(`jumlah`) AS `jumlah`
FROM `transaksi`
WHERE `jenis_transaksi` = 'masuk'
AND `tanggal` >= '2026-04-17 00:00:00'
AND `tanggal` <= '2026-04-17 23:59:59'
 LIMIT 1
SELECT SUM(`jumlah`) AS `jumlah`
FROM `transaksi`
WHERE `jenis_transaksi` = 'keluar'
AND `tanggal` >= '2026-04-17 00:00:00'
AND `tanggal` <= '2026-04-17 23:59:59'
 LIMIT 1
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $barangModel     = new BarangModel();
        $transaksiModel  = new TransaksiModel();
        $userModel       = new UserModel();
        $sewaModel       = new SewaModel();
        $laporanModel    = new LaporanModel();
        $db              = Database::connect();

        $today = date('Y-m-d');
        $currentMonth = date('m');
        $currentYear = date('Y');

        // =============================
        // STATISTIK BARANG MASUK/KELUAR
        // =============================
        $todayMasuk = $transaksiModel
            ->selectSum('jumlah')
            ->where('jenis_transaksi', 'masuk')
            ->where('tanggal >=', $today . ' 00:00:00')
            ->where('tanggal <=', $today . ' 23:59:59')
            ->first();

        $todayKeluar = $transaksiModel
            ->selectSum('jumlah')
            ->where('jenis_transaksi', 'keluar')
            ->where('tanggal >=', $today . ' 00:00:00')
            ->where('tanggal <=', $today . ' 23:59:59')
            ->first();

SELECT COUNT(*) AS `numrows` FROM `transaksi`
SELECT COUNT(*) AS `numrows` FROM `barang`
SELECT COUNT(*) AS `numrows` FROM `sewa`
SELECT COUNT(*) AS `numrows`
FROM `sewa`
WHERE `checkout` > '2026-04-17'
---
            ->first();

        $data['totalStok']      = $totalStok['stok'] ?? 0;
        $data['totalTransaksi'] = $transaksiModel->countAll();
        $data['jumlahBarang']   = $barangModel->countAll();

        // =============================
        // STATISTIK PENYEWAAN
        // =============================
        $data['totalPenyewaan'] = $sewaModel->countAll();

        $data['penyewaanAktif'] = $sewaModel
            ->where('checkout >', $today)
            ->countAllResults();

SELECT `kategori_sewa`
FROM `detail_sewa`
WHERE `sewa_id` = '1'
GROUP BY `kategori_sewa`
---
            $s['durasi'] = $checkin->diff($checkout)->days;
            $s['status'] = ($s['checkout'] > $today) ? 'Aktif' : 'Selesai';

            $detailItems = $db->table('detail_sewa')
                ->select('kategori_sewa')
                ->where('sewa_id', $s['id'])
                ->groupBy('kategori_sewa')
                ->get()
                ->getResultArray();

SELECT `transaksi`.*, `barang`.`nama_barang`, `barang`.`satuan`, COALESCE(users.email, "Tidak diketahui") as operator
FROM `transaksi`
JOIN `barang` ON `barang`.`id` = `transaksi`.`id_barang`
LEFT JOIN `users` ON `users`.`id` = `transaksi`.`id_user`
WHERE DATE(transaksi.tanggal) >= '2026-04-10'
OR DATE(transaksi.created_at) = '2026-04-17'
ORDER BY `transaksi`.`id` DESC
---
        $data['penyewaanHariIni'] = $penyewaanHariIni;

        // TRANSAKSI HARI INI - AMBIL SEMUA DATA (TIDAK DIBATASI) //
        $transaksiHariIni = $transaksiModel
        ->select('transaksi.*, barang.nama_barang, barang.satuan, COALESCE(users.email, "Tidak diketahui") as operator')
        ->join('barang', 'barang.id = transaksi.id_barang')
        ->join('users', 'users.id = transaksi.id_user', 'left')
        ->where('DATE(transaksi.tanggal) >=', date('Y-m-d', strtotime('-7 days')))
        ->orWhere('DATE(transaksi.created_at)', $today)
        ->orderBy('transaksi.id', 'DESC')
        ->findAll();

SELECT COALESCE(users.email, "Unknown") as nama, COUNT(transaksi.id) as total
FROM `transaksi`
LEFT JOIN `users` ON `users`.`id` = `transaksi`.`id_user`
GROUP BY `transaksi`.`id_user`
ORDER BY `total` DESC
 LIMIT 3
SELECT `transaksi`.*, `barang`.`nama_barang`, `barang`.`satuan`, COALESCE(users.email, "System") as operator
FROM `transaksi`
JOIN `barang` ON `barang`.`id` = `transaksi`.`id_barang`
LEFT JOIN `users` ON `users`.`id` = `transaksi`.`id_user`
WHERE `jenis_transaksi` = 'keluar'
ORDER BY `transaksi`.`id` DESC
 LIMIT 5
---
        $data['stokRendah'] = $stokRendah;

        // TOP OPERATOR //
        $topOperator = $transaksiModel
            ->select('COALESCE(users.email, "Unknown") as nama, COUNT(transaksi.id) as total')
            ->join('users', 'users.id = transaksi.id_user', 'left')
            ->groupBy('transaksi.id_user')
            ->orderBy('total', 'DESC')
            ->findAll(3);
        $data['topOperator'] = $topOperator;

        // BARANG KELUAR TERBARU (5 data) //
        $barangKeluarTerbaru = $transaksiModel
            ->select('transaksi.*, barang.nama_barang, barang.satuan, COALESCE(users.email, "System") as operator')
            ->join('barang', 'barang.id = transaksi.id_barang')
            ->join('users', 'users.id = transaksi.id_user', 'left')
            ->where('jenis_transaksi', 'keluar')
            ->orderBy('transaksi.id', 'DESC')
            ->limit(5)
            ->findAll();