app/Controllers/BarangController.php

    public function index()
    {
        $selectedKategori = $this->request->getGet('kategori');
        $selectedStatus = $this->request->getGet('status_kondisi'); // ✅ TAMBAHKAN INI

        // Filter berdasarkan kategori dan status
        $barang = $this->barangModel->getBarangWithKategori();

        // Filter berdasarkan kategori
        if (!empty($selectedKategori)) {
            $barang = array_filter($barang, function($item) use ($selectedKategori) {
                return $item['kategori_id'] == $selectedKategori;
            });
        }

        // Filter berdasarkan status kondisi
        if (!empty($selectedStatus)) {
            $barang = array_filter($barang, function($item) use ($selectedStatus) {
                return ($item['kondisi'] ?? 'baik') == $selectedStatus;
            });
        }

        $totalMasukGlobal = 0;
        $totalKeluarGlobal = 0;
        $subItems = [];

        foreach ($barang as &$b) {
            // AMBIL TRANSAKSI MASUK TERAKHIR
            $lastMasuk = $this->transaksiModel
                ->where('id_barang', $b['id'])
                ->where('jenis_transaksi', 'masuk')
                ->orderBy('id', 'DESC')
                ->first();

            // AMBIL TRANSAKSI KELUAR TERAKHIR
            $lastKeluar = $this->transaksiModel
                ->where('id_barang', $b['id'])
                ->where('jenis_transaksi', 'keluar')
                ->orderBy('id', 'DESC')
                ->first();
---
SELECT *
FROM `transaksi`
WHERE `id_barang` = '10'
AND `jenis_transaksi` = 'masuk'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `transaksi`
WHERE `id_barang` = '10'
AND `jenis_transaksi` = 'keluar'
ORDER BY `id` DESC
 LIMIT 1

            $b['total_keluar'] = $lastKeluar['jumlah'] ?? 0;

            // Untuk summary cards (total keseluruhan)
            $totalMasukGlobal += $this->transaksiModel
                ->where('id_barang', $b['id'])
                ->where('jenis_transaksi', 'masuk')
                ->selectSum('jumlah')
                ->first()['jumlah'] ?? 0;

            $totalKeluarGlobal += $this->transaksiModel
                ->where('id_barang', $b['id'])
                ->where('jenis_transaksi', 'keluar')
                ->selectSum('jumlah')
                ->first()['jumlah'] ?? 0;
---
SELECT SUM(`jumlah`) AS `jumlah`
FROM `transaksi`
WHERE `id_barang` = '10'
AND `jenis_transaksi` = 'masuk'
 LIMIT 1
SELECT SUM(`jumlah`) AS `jumlah`
FROM `transaksi`
WHERE `id_barang` = '10'
AND `jenis_transaksi` = 'keluar'
 LIMIT 1