app/Controllers/LaporanController.php

SELECT *
FROM `laporan`
ORDER BY `created_at` DESC
SELECT COUNT(*) AS `numrows`
FROM `laporan`
WHERE DATE(created_at) = '2026-04-17'
SELECT COUNT(*) AS `numrows`
FROM `laporan`
WHERE DATE_FORMAT(created_at, "%Y-%m") = '2026-04'
---
    public function index()
    {
        $data['laporan'] = $this->laporanModel
            ->orderBy('created_at', 'DESC')
            ->findAll();

        $data['summary'] = $this->laporanModel->getSummary();

        $today = date('Y-m-d');
        $thisMonth = date('Y-m');

        $data['today_count'] = $this->laporanModel
            ->where('DATE(created_at)', $today)
            ->countAllResults();

        $data['month_count'] = $this->laporanModel
            ->where('DATE_FORMAT(created_at, "%Y-%m")', $thisMonth)
            ->countAllResults();

SELECT *
FROM `laporan`
WHERE `laporan`.`id` = '1'
DELETE FROM `laporan`
WHERE `id` IN ('1')
---
    public function delete($id)
    {
        // Hanya admin yang boleh hapus laporan
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/laporan')->with('error', 'Akses ditolak! Hanya admin yang dapat menghapus laporan.');
        }

        $laporan = $this->laporanModel->find($id);

        if (!$laporan) {
            return redirect()->to('/laporan')->with('error', 'Data tidak ditemukan');
        }

        $this->laporanModel->delete($id);