app/Controllers/Sewa.php

SELECT *
FROM `kategori`
---
    public function create($id = null)
    {
        $barang = $this->barangModel->getBarangWithKategori();
        $kategori = $this->kategoriModel->findAll();

SELECT *
FROM `barang`
WHERE `barang`.`id` = '10'
---

    // Validasi stok
    foreach ($detail as $item) {
        $barang = $this->barangModel->find($item['barang_id']);

INSERT INTO `sewa` (`nama_penyewa`, `checkin`, `checkout`, `kategori`, `total_harga`, `subtotal`, `diskon`, `diskon_persen`, `lokasi`, `deskripsi`, `created_at`) VALUES ('test5', '2026-04-17', '2026-04-30', 'harian', 1290000, 1300000, 10000, 0.76923076923077, 'jawa timur', 'test', '2026-04-17 18:38:25')
---
            'created_at' => date('Y-m-d H:i:s')
        ];

        $this->sewaModel->insert($saveData);

INSERT INTO `detail_sewa` (`sewa_id`, `barang_id`, `qty`, `harga`, `subtotal`, `kategori_sewa`, `created_at`) VALUES (1, 10, 1, 100000, 1300000, 'harian', '2026-04-17 18:38:25')
SELECT *
FROM `barang`
WHERE `barang`.`id` = '10'
UPDATE `barang` SET `stok` = 2, `updated_at` = '2026-04-17 18:38:25'
WHERE `barang`.`id` IN ('10')
---
                'created_at' => date('Y-m-d H:i:s')
            ];

            $this->db->table('detail_sewa')->insert($detailData);

            $barang = $this->barangModel->find($item['barang_id']);
            if ($barang) {
                $stokBaru = $barang['stok'] - $item['jumlah'];
                $this->barangModel->update($item['barang_id'], ['stok' => $stokBaru]);

SELECT *
FROM `sewa`
WHERE `sewa`.`id` = '1'
SELECT `detail_sewa`.*, `barang`.`nama_barang`, `kategori`.`nama` as `kategori`
FROM `detail_sewa`
JOIN `barang` ON `barang`.`id` = `detail_sewa`.`barang_id`
LEFT JOIN `kategori` ON `kategori`.`id` = `barang`.`kategori_id`
WHERE `detail_sewa`.`sewa_id` = '1'
---
    public function success($id)
    {
        $sewa = $this->sewaModel->find($id);

        if (!$sewa) {
            return redirect()->to('/barang')->with('error', 'Data tidak ditemukan');
        }

        $items = $this->db->table('detail_sewa')
            ->select('detail_sewa.*, barang.nama_barang, kategori.nama as kategori')
            ->join('barang', 'barang.id = detail_sewa.barang_id')
            ->join('kategori', 'kategori.id = barang.kategori_id', 'left')
            ->where('detail_sewa.sewa_id', $id)
            ->get()
            ->getResultArray();

SELECT *
FROM `sewa`
WHERE `sewa`.`id` = '1'
SELECT `detail_sewa`.*, `barang`.`nama_barang`, `kategori`.`nama` as `kategori_barang`
FROM `detail_sewa`
JOIN `barang` ON `barang`.`id` = `detail_sewa`.`barang_id`
LEFT JOIN `kategori` ON `kategori`.`id` = `barang`.`kategori_id`
WHERE `detail_sewa`.`sewa_id` = '1'
SELECT *
FROM `laporan`
WHERE `sewa_id` = '1'
 LIMIT 1
---
    public function simpanLaporan($id)
    {
        $sewa = $this->sewaModel->find($id);

        if (!$sewa) {
            return redirect()->back()->with('error', 'Data tidak ditemukan');
        }

        $items = $this->db->table('detail_sewa')
            ->select('detail_sewa.*, barang.nama_barang, kategori.nama as kategori_barang')
            ->join('barang', 'barang.id = detail_sewa.barang_id')
            ->join('kategori', 'kategori.id = barang.kategori_id', 'left')
            ->where('detail_sewa.sewa_id', $id)
            ->get()
            ->getResultArray();

        $cek = $this->laporanModel->where('sewa_id', $id)->first();

INSERT INTO `laporan` (`sewa_id`, `nama_penyewa`, `detail_json`, `deskripsi`, `checkin`, `checkout`, `kategori`, `total_harga`, `lokasi`, `created_at`, `updated_at`) VALUES ('1', 'test5', '[{\"barang_id\":\"10\",\"nama_barang\":\"Tv 43 inch Xiaomi\",\"kategori\":\"Inventaris TV\",\"kategori_sewa\":\"harian\",\"qty\":\"1\",\"harga\":\"100000.00\",\"subtotal\":\"1300000.00\"}]', 'test', '2026-04-17', '2026-04-30', 'harian', '1290000', 'jawa timur', '2026-04-17 18:38:36', '2026-04-17 18:38:36')
---
        ];

        try {
            $this->laporanModel->insert($laporanData);