app/Models/BarangModel.php

SELECT `barang`.*, `kategori`.`nama` as `nama_kategori`
FROM `barang`
LEFT JOIN `kategori` ON `kategori`.`id` = `barang`.`kategori_id`
---
    public function getBarangWithKategori()
    {
        return $this->select('barang.*, kategori.nama as nama_kategori')
                    ->join('kategori', 'kategori.id = barang.kategori_id', 'left')
                    ->findAll();