app/Models/LaporanModel.php

SELECT SUM(`total_harga`) AS `total_harga`
FROM `laporan`
SELECT COUNT(*) AS `numrows` FROM `laporan`
SELECT COUNT(*) AS `numrows`
FROM `laporan`
WHERE `kategori` = 'harian'
SELECT COUNT(*) AS `numrows`
FROM `laporan`
WHERE `kategori` = 'event'
---
    public function getSummary()
    {
        $totalPendapatan = $this->selectSum('total_harga')->get()->getRow()->total_harga ?? 0;
        $totalSewa = $this->countAll();
        $sewaHarian = $this->where('kategori', 'harian')->countAllResults();
        $sewaEvent = $this->where('kategori', 'event')->countAllResults();