app/Models/SubItemModel.php

    public function getByBarang($barang_id)
    {
        return $this->where('barang_id', $barang_id)
                    ->orderBy('nama', 'ASC')
                    ->findAll();
---
SELECT *
FROM `sub_item`
WHERE `barang_id` = '10'
ORDER BY `nama` ASC